{
  "format": "layers-model",
  "generatedBy": "keras v3.13.1",
  "convertedBy": "TensorFlow.js Converter v4.22.0",
  "modelTopology": {
    "keras_version": "3.13.1",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential_10",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_shape": [
                null,
                42
              ],
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "input_layer_10",
              "optional": false,
              "batch_input_shape": [
                null,
                42
              ]
            }
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout_20",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "rate": 0.2,
              "seed": null,
              "noise_shape": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_30",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "units": 20,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null,
              "quantization_config": null
            }
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout_21",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "rate": 0.4,
              "seed": null,
              "noise_shape": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_31",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "units": 10,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null,
              "quantization_config": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_32",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "units": 37,
              "activation": "softmax",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null,
              "quantization_config": null
            }
          }
        ],
        "build_input_shape": [
          null,
          42
        ]
      }
    },
    "training_config": {
      "loss": "sparse_categorical_crossentropy",
      "loss_weights": null,
      "metrics": [
        "accuracy"
      ],
      "weighted_metrics": null,
      "run_eagerly": false,
      "steps_per_execution": 1,
      "jit_compile": false,
      "optimizer_config": {
        "class_name": "Adam",
        "config": {
          "name": "adam",
          "learning_rate": 0.0010000000474974513,
          "weight_decay": null,
          "clipnorm": null,
          "global_clipnorm": null,
          "clipvalue": null,
          "use_ema": false,
          "ema_momentum": 0.99,
          "ema_overwrite_frequency": null,
          "loss_scale_factor": null,
          "gradient_accumulation_steps": null,
          "beta_1": 0.9,
          "beta_2": 0.999,
          "epsilon": 1e-07,
          "amsgrad": false
        }
      }
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of1.bin"
      ],
      "weights": [
        {
          "name": "dense_30/kernel",
          "shape": [
            42,
            20
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_30/bias",
          "shape": [
            20
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_31/kernel",
          "shape": [
            20,
            10
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_31/bias",
          "shape": [
            10
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_32/kernel",
          "shape": [
            10,
            37
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_32/bias",
          "shape": [
            37
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}