{
  "format": "layers-model",
  "generatedBy": "keras v3.13.1",
  "convertedBy": "TensorFlow.js Converter v4.22.0",
  "modelTopology": {
    "keras_version": "3.13.1",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential_2",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_shape": [
                null,
                42
              ],
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "input_layer_2",
              "optional": false,
              "batch_input_shape": [
                null,
                42
              ]
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_8",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "units": 128,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "HeNormal",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null,
              "quantization_config": null
            }
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_6",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "axis": -1,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "gamma_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "moving_mean_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "moving_variance_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null,
              "synchronized": false
            }
          },
          {
            "class_name": "Activation",
            "config": {
              "name": "activation_6",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "activation": "relu"
            }
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout_6",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "rate": 0.3,
              "seed": null,
              "noise_shape": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_9",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "units": 64,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "HeNormal",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null,
              "quantization_config": null
            }
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_7",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "axis": -1,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "gamma_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "moving_mean_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "moving_variance_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null,
              "synchronized": false
            }
          },
          {
            "class_name": "Activation",
            "config": {
              "name": "activation_7",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "activation": "relu"
            }
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout_7",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "rate": 0.3,
              "seed": null,
              "noise_shape": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_10",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "units": 32,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "HeNormal",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null,
              "quantization_config": null
            }
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_8",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "axis": -1,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "gamma_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "moving_mean_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "moving_variance_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null,
              "synchronized": false
            }
          },
          {
            "class_name": "Activation",
            "config": {
              "name": "activation_8",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "activation": "relu"
            }
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout_8",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "rate": 0.2,
              "seed": null,
              "noise_shape": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_11",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "units": 37,
              "activation": "softmax",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null,
              "quantization_config": null
            }
          }
        ],
        "build_input_shape": [
          null,
          42
        ]
      }
    },
    "training_config": {
      "loss": "sparse_categorical_crossentropy",
      "loss_weights": null,
      "metrics": [
        "accuracy"
      ],
      "weighted_metrics": null,
      "run_eagerly": false,
      "steps_per_execution": 1,
      "jit_compile": false,
      "optimizer_config": {
        "class_name": "Adam",
        "config": {
          "name": "adam",
          "learning_rate": 0.0005000000237487257,
          "weight_decay": null,
          "clipnorm": null,
          "global_clipnorm": null,
          "clipvalue": null,
          "use_ema": false,
          "ema_momentum": 0.99,
          "ema_overwrite_frequency": null,
          "loss_scale_factor": null,
          "gradient_accumulation_steps": null,
          "beta_1": 0.9,
          "beta_2": 0.999,
          "epsilon": 1e-07,
          "amsgrad": false
        }
      }
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of1.bin"
      ],
      "weights": [
        {
          "name": "batch_normalization_6/gamma",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_6/beta",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_6/moving_mean",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_6/moving_variance",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_7/gamma",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_7/beta",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_7/moving_mean",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_7/moving_variance",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_8/gamma",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_8/beta",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_8/moving_mean",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_8/moving_variance",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_10/kernel",
          "shape": [
            64,
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_10/bias",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_11/kernel",
          "shape": [
            32,
            37
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_11/bias",
          "shape": [
            37
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_8/kernel",
          "shape": [
            42,
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_8/bias",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_9/kernel",
          "shape": [
            128,
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_9/bias",
          "shape": [
            64
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}