1
1,00,00,000
1,00,000
1,000
10
10,000
10,000,000
100
100,000
1000
10000
100000
10000000
2
3
4
5
500
6
7
8
9
a hundred
a lot
a thousand
a(article)
a(double-handed-letter)
a(single-handed-letter)
abandoned
absurd
abu bakr siddique
accounting
ache
achievement
act upon
adam(first-man)
address(noun)
admire
advantage
advantageous
advertise
advertisement
advertising
advice
aeroplane
afghanistan
afternoon
again
age
agile(physically)
agility(physical)
ahead
aid
air
aircraft
airfield
airplane
airport
alarm(clock)
alayhe assallam
alhamra
all
allah
allama iqbal
allama mohammad iqbal
allama muhammad iqbal
alligator
along
always
am
ambulance
america(country)
american(country)
amnesty
an
anarkali
and
angel
anger
angry(displeased)
angry(furious)
animosity
anniversary
annoyed
annual
annually
annum
answer
answered
answering
anticipate
anticipation
antonym
anxiety
anxious
apologize
apology
apostle
apple
application(request)
apprentice
approval
approve
apricot
april(month)
are
area
arrogance
arrogant
art
arts
ashamed
asr
assembly(congregation)
assistance
at
attention
attorney
aubergine
august(month)
aunt(father's-sister-پھوپھی)
aunt(father's-younger-brother's-wife-چچی)
aunt(mother's-brother's-wife-ممانی)
aunt(mother's-sister-خالہ)
aunty(father's-sister-پھوپھی)
aunty(father's-younger-brother's-wife-چچی)
aunty(mother's-brother's-wife-ممانی)
aunty(mother's-sister-خالہ)
australia
australian
autumn
awake
awaken
awakened
away
b(double-handed-letter)
b(single-handed-letter)
backbiting
bad deed
badshahi masjid
badshahi mosque
bag(noun)
ball point
ball point pen
ballpoint
ballpoint pen
balochistan
banana
bananas
bandit
bangladesh
bank(institution)
banter
basis
bathroom
beautiful
beauty
become
beef
before
beg
began
beggar
begin
beginning
begins
begun
belief
bell
beneficial
benefit
between
beverage
birthday
biscuit
biscuits
bitch
black
blessing
blue
book
bookshop
bookstore
boots
borrow
boss
bottle(noun)
boy
bread
break(pause)
bribe
bribery
brinjal
broken heart
broken hearted
brother
brother's daughter
brother's son
brother's wife
brown
brutal
brutality
build
built
bully
bunny
burger
bus
bus stand
bus station
bus stop
busstop
busy
butter
by(active-voice-نے)
c(double-handed-letter)
c(single-handed-letter)
cake
calculator
calendar
calm
calmness
came and went
came(آئی)
came(آئے)
came(آیا)
camel
camera
canal
candy
car
carrot
cartoon
cartoonish
castle
cat
cauliflower
celebrate
celebration
cemetery
center
centre
chair
chairman
chairperson
chairwoman
chakwal
chana chaat
change
changed
changing
chapati
charcoal
chat
chauburji
chaudhary
cheif
chicken
chicken meat
chief minister
chill
chilled
chilly
china
china clay
chingchi
chips(fries)
christian
christianity
christians
city
classroom
clay
clever
close(near)
close(shut)
closed
closet
cnic
coal
cock
coconut
coercion
coffee
cold
collection
college
color
colour
come and go
come(آؤ)
come(آؤں)
come(آئیں)
coming and going
company(corporation)
competition
competitiveness
complain
complaining
complaint
complete
completed
complexion
comply
concentrate(focus)
confectionery
confused
conquest
consent
consider
consideration
consist
construct
constructed
contained
containing
contains
continent
continental
convenience
convenient
conversation
conversion
convert
converted
converting
cookie
cookies
cool
copy(clone)
copying
coriander
corporate
corporation
country(homeland)
cow
cow meat
create
created
creator
crocodile
crow
crowd
crowded
cruel
cruelty
cucumber
cunning
cupboard
d(double-handed-letter)
d(single-handed-letter)
dacoit
dad
daddy
dahi bhale
dahi bhally
damage
date(calendar)
daughter
day
day after tomorrow
day off
debt
december
decent
decorate
decorated
decoration
defamation
defamed
defect
defective
definitely
delightful
denim pants
depressed
depressing
depression
deserted
desire
desk
desolate
devil
diary
difficult
difficulty
discharged
discipline
disgrace
disgraced
dishonoured
disregard
distant
do(feminine-کرتی)
do(masculine-کرتا)
do(کرتے)
do(کرو)
do(کروں)
do(کریں)
do(کرے)
doctor(physician)
does(feminine-کرتی)
does(masculine-کرتا)
dog
doggy
donkey
donkey carriage
donkey cart
donkey chariot
door
drama
drama serial
drama series
dream
dubai
duck
dupatta
duplicate
duty
e(double-handed-letter)
e(single-handed-letter)
early
earth
ease
easily
easiness
easy
effort
egg
eggplant
eight
elderly man
elderly woman
election
elections
elephant
embarrassed
embarrassing
embarrassment
emergency
endeavor
enemy
england
english(language)
enmity
entertaining
entertainment
entire
entrust
entrusted
eraser
erroneous
error
essential
ethnic
ethnicity
eve(first-woman)
evening
every
evil
exam
examination
excuse(justification)
exercise
exhibition
extravagant
f(double-handed-letter)
f(single-handed-letter)
factory
fail
failed
failure
faisal masjid
faisal mosque
faisalabad
faith
fajar
fajr
false
falsehood
fame
family
famous
far
far away
farmer
fashion
fashionable
fast(quick)
fasting
fate
father
fearsome
feast
february
female
feminine
few
fighter jet
fighter plane(airplane)
film(movie)
final
find
finding(verb)
fine(penalty)
fined(penalty)
first
fish
fit
fitness
five
five hundred
flatbread(naan)
flatbread(roti)
flour
flower
focus
fondness
fool
foolish
for(لئے)
for(کیلئے)
forest
forever
forgive
forgiveness
fort
fortress
forward
found(find)
foundation
founder
four
fraud
free(at-liberty)
freed
freedom
friday
friend
fries(chips)
frightening
frock
frog
from
front
fruit
fruits
full
fun
furious
futile
g(double-handed-letter)
g(single-handed-letter)
gangster
garden
garlic
gate(noun)
gave
gentleman
ginger
giraffe
girl
give
given
go(جاؤ)
go(جاؤں)
go(جائیں)
go(جائے)
goat
goat meat
god
gold
golden
gone(feminine-گئی)
gone(masculine-گیا)
gone(گئے)
good
good deed
gorgeous
gossip
government
governmental
govt
grandfather(maternal)
grandfather(paternal)
grandmother(maternal)
grandmother(paternal)
grape
grapes
grave(burial)
graveyard
gray
great
greed
greedy
green
green chilli
greenish
grey
ground(land)
guardianship
guava
gujarat
gujranwala
h(double-handed-letter)
h(single-handed-letter)
habit
habitually
had(feminine-چکی)
had(masculine-چکا)
had(چکے)
hadith
hailstorm
hajj
half an hour
half hour
handsome
happiness
happy
happy talk
happytalk
hard work
hard worker
hardship
hardwork
hardworking
hare
has(feminine-چکی)
has(masculine-چکا)
haste
hate
hatred
have(چکے)
hazrat abu bakr
hazrat abu bakr siddique
hazrat abubakr
hazrat adam
hazrat ali
hazrat ali ibn abi talib
hazrat hawa
hazrat mohammad
hazrat muhammad
hazrat omar
hazrat omar bin khattab
hazrat omer farooq
hazrat osman
hazrat umer
hazrat umer bin khattab
hazrat umer farooq
hazrat usman
hazrat usman ghani
hazrat uthman
he
heart breaking
heart broken
heartbreaking
heartbroken
heat(noun)
heaven
hell
help
helpful
hen
here
hills
hilly
hindu
hindustan
historic places
historic sites
holiday
holy qur'an
holy quran
home
honest
honestly
honesty
honourable
horde
horrifying
horse
hospital
hostel
hostility
hot
hotel
hour
house
how many
how much
how(feminine-کیسی)
how(masculine-کیسا)
how(کیسے)
humiliated
humiliation
hurry
husband
i(double-handed-letter)
i(me)
i(single-handed-letter)
iblis
ice cream
icecream
id card
identification card
identity card
idiot
idiotic
idle
ignore
ignored
ill
illiteracy
illiterate
image
imam
imam ali
important
impoverished
in
inaccurate
include
included
including
inclusive
incorrect
indeed
independence
india
indian
infidel
inflation(economic)
information
ing(رہا)
ing(رہو)
ing(رہی)
ing(رہیں)
ing(رہے)
initiate
ink
inside
instructor
instruments
insult
insulted
intelligent
intention
interest(fondness)
interested
interesting
investigate
iran
iranian
iraq
iraqi
iron(metal)
irrigate
irrigation
is
isha
islamabad
islamiat
islamiyat
it
j(double-handed-letter)
j(single-handed-letter)
jambul
jamun
january
japan
japanese
java plum
jeans
jeans pants
jhelum
jihad
job
joke
joy
judge(noun)
juice
july
june
jungle
k(double-handed-letter)
k(single-handed-letter)
kalma chowk
kalmah
kameez
karachi
kebab
keenness
khyber pakhtunkhwa
knowledge
knowledgeable
koran
kuwait
l(double-handed-letter)
l(single-handed-letter)
laborer
labourer
lady
lady finger
lahore
land(ground)
last(final)
latest
law
lawyer
lazily
laziness
lazy
leaf
legal
lemon
lentil
lentils
liar
liberate
liberated
liberty(freedom)
liberty(place)
library
lie(untruth)
like(admire)
liked
likes(admires)
liking
limestone
lion
lioness
loan
loathe
loathing
locality
location
look(دیکھو)
look(دیکھوں)
look(دیکھیں)
look(دیکھے)
looked(دیکھا)
looked(دیکھی)
looked(دیکھے)
loss
lots
luck
lunar
lying(untruth)
m(double-handed-letter)
m(single-handed-letter)
made
maghrib
maid
make
male
mama
man(noun)
mango
mangoes
mangos
manly
manufacture
manufactured
many
march(month)
marine
market
marriage
masculine
masjid
maternal grandfather
maternal grandmother
math
mathematics
maths
may(month)
maybe
me
medication
medicine(drug)
meeting(noun)
melon
mendicant
merciless
mercy
meter rod
middle
military aircraft
milk
minar e pakistan
minar-e-pakistan
mine(feminine-میری)
mine(masculine-میرا)
mine(میرے)
minute(unit-of-time)
minutes(unit-of-time)
miser
mistake
mistaken
mom
mommy
monday
monitor(prefect)
monkey
monotheism
monotheistic
month
monthly
moon
morning
mosque
mother
motorbike
motorcycle
mountain
mountainous
mountains
mouse
movie
muhammad ali jinnah
multan
murree
museum
muslim
muslims
mutiny
mutton
my(feminine-میری)
my(masculine-میرا)
my(میرے)
n(double-handed-letter)
n(single-handed-letter)
naan
namaz
name
named
nawab
near
nearby
necessary
neighbor
neighborhood
neighbors
neighbour
neighbourhood
neighbours
nephew(brother's-son)
nephew(sister's-son)
new
newspaper
next
niece(brother's-daughter)
niece(sister's-daughter)
night
nine
no
noise
noisy
nonsense
noodles
noon
not
notebook
november
now a days
now(اب)
o(double-handed-letter)
o(single-handed-letter)
obedience
obedient
obey
obstinacy
ocean
october
of(feminine-کی)
of(masculine-کا)
of(کے)
off time
offended
office
okra
old man
old woman
olympic
olympics
on(at)
one
one crore
one hundred
one lakh
one thousand
onion
orange(color)
orange(fruit)
our(feminine-ہماری)
our(masculine-ہمارا)
our(ہمارے)
outing
owl
own(adjective-اپنا)
own(adjective-اپنی)
own(adjective-اپنے)
owner
p(double-handed-letter)
p(single-handed-letter)
pain
pajamas
pak studies
pak study
pakistan
pakistan studies
pakistani
pale
pants(trousers)
papa
parade
paradise
pardon
parrot
parsley
pass(succeed)
paternal grandfather
paternal grandmother
patient(sick)
peace of mind
peacock
pen
penalty
pencil
penniless
people
perhaps
permission
peshawar
photo
photograph
physician
picture
pigeon
pilgrimage
pinchpenny
pineapple
pink
place
plagiarism
plagiarize
plane(aeroplane)
plants
play(sports)
played(sports)
playing(sports)
plays(sports)
pleasant
pleasing
pledge
pledged
plural
poet
poetess
poetry
pointless
police man
police officer
police woman
policeman
polytheism
pomegranate
poor(penniless)
popular
population
position
post office
potato
poverty
prayer(namaz)
preach
preaching
preachment
preoccupied
previous
pride
prime minister
principal
principle
prior
problem
process
procession
professions
professor
program
programed
programme
promise
promised
prophet
protected
protection
proud
province
provincial
pulses(lentils)
punctual
punctuality
punish
punishment
punjab
purple
purpose
q(double-handed-letter)
q(single-handed-letter)
quaid e azam
quaid e azam muhammad ali jinnah
quaid-e-azam
quaid-e-azam muhammad ali jinnah
question
quetta
quick
quickly
qur'an
quran
quranic
r(double-handed-letter)
r(single-handed-letter)
rabbit
radish
railway station
rain
rainbow
rained
rainfall
raining
rainy
rapid(quick)
rapidly
rascal
rat
raven
rawalpindi
rebel
rebellion
rebelliousness
reconcile
reconciled
reconciliation
red
red chilli
relative(family)
relax
relaxed
relaxing
replace
replaceing
replacement
residence
respect
respectful
responsibility
responsible
responsibly
rest(relax)
restaurant
rested
resting
restless
restlessness
result
revolt
reward(spiritual)
rice
rich
rickshaw
right now(ابھی)
right(entitlement)
rivalry
river
road
robber
robbery
rooster
roti
rubber(eraser)
ruined
rule(principle)
ruler(scale)
rumor
rumour
rural
s(double-handed-letter)
s(single-handed-letter)
sad
saddened
saddening
sadness
safe
safety
sahiwal
salat
salt
salted
salty
samosa
sandals
sargodha
satan
saturday
saudi
saudi arabia
saudi arabian
saw(looked-دیکھا)
saw(looked-دیکھی)
saw(looked-دیکھے)
scale(ruler)
scarf
scary
schedule
school
school cafe
school cafeteria
school canteen
science
scientific
scoundrel
scout
sea
search
searched
searching
season(weather)
second(unit-of-time)
seconds(unit-of-time)
secure
security
security guard
see(دیکھو)
see(دیکھوں)
see(دیکھیں)
see(دیکھے)
seen(دیکھا)
seen(دیکھی)
selfish
selfishness
senseless
sepoy
september
servant
seven
shade(shadow)
shadow
shall(masculine-گا)
shame
sharpener
she
sheikhupura
ship(boat)
shirt
shoe
shoes
shop
shopkeeper
shrine
shut
shy
shyness
sialkot
sick
silver
sin
sindh
singular
sister
sister's daughter
sister's son
sister-in-law(brother's-wife)
six
sky
slippers
snatch
snatched
social
society
solar
solider
some
son
soon
sorrow
sorrowful
soup
sparrow
spectacle
speedy
spinach
spoiled
sports
spring(season)
spring(water-basin)
spy
spying
stadium
staff room
staffroom
stapler
stars
start
started
starting
stingy
storm
stormy
story
strawberry
street
streets
stroll
stubborn
stubbornness
student
stupid
succeed
succeeded
success
successful
sudden
suddenly
suffer
suffering
sugar
sugar cane
sugarcane
suggestion
summer
sun
sunday
sunny
surely
swarm
sweets
swiftly
system
t(double-handed-letter)
t(single-handed-letter)
table(furniture)
tale
talk
task
tax
taxation
taxes
tea
teacher
television
ten
ten thousand
terrifying
test
textbook
that
theft
therapist
there
they
thief
thirst
thirsty
this
three
thursday
till(limit)
time
time off
timetable
to
to you(formal-آپ)
toad
today
toffee
together
toilet
tomato
tomb
tomorrow
tools
tortoise
tracksuit
tractor
train station
train(vehicle)
tranquility
transform
transformed
transforming
transportation
tree
trouble
true
truth
truthful
truthfully
try
trying
tuesday
turkey(country)
turtle
tutor
tv
two
u(double-handed-letter)
u(single-handed-letter)
uncle(father's-sister's-husband-پھوپھا)
uncle(father's-younger-brother-چچا)
uncle(mother's-brother-ماموں)
uncle(mother's-sister's-husband-خالو)
uneducated
unhappy
uniform(costume)
uninhabited
united states of america
university
unnecessary
unnecessary expense
unoccupied
until
untruth
unwell
up to
upset
urdu
us(country)
us(we)
usa
usage
use
useful
usefulness
useless
utility
utilize
v(double-handed-letter)
v(single-handed-letter)
van
various
vegetables
verse(quran)
very
victory
village
volcanic
volcano
vote
voting
w(double-handed-letter)
w(single-handed-letter)
wait
waiting
wake
wake up
waking up
walk
walking
warm
warmth
was(feminine-تھی)
was(masculine-تھا)
washroom
waste of money
wasteful
wasteful spending
watch(look-دیکھو)
watch(look-دیکھوں)
watch(look-دیکھی)
watch(look-دیکھیں)
watch(look-دیکھے)
watch(looked-دیکھا)
watched(دیکھا)
watched(دیکھی)
watched(دیکھے)
watchman
watermelon
we
weak
weaker
weakness
wealth
wealthy
weather
wedding
wednesday
week
welcome(exclamation)
welcome(reception)
well mannered
went(feminine-گئی)
went(masculine-گیا)
went(گئے)
were(تھے)
what
when
white
who
whom
whose
wife
will(feminine-گی)
will(masculine-گا)
will(گے)
wind storm
winter
wise
wish
with
woman
word
words
work
work dodger
work-shy
workout
workplace
workshy
world
worried
worry
wrath
wrong
x(double-handed-letter)
x(single-handed-letter)
y(double-handed-letter)
y(single-handed-letter)
year
yearly
yellow
yellowish
yogurt
you(formal-آپ)
you(تم)
you(تمہیں)
your(آپکا)
your(آپکی)
your(آپکے)
your(تمہارا)
your(تمہاری)
your(تمہارے)
yours(تمہارا)
yours(تمہاری)
yours(تمہارے)
z(double-handed-letter)
z(single-handed-letter)
zakat
zohr(prayer)
zoo
zuhr